{
  "en->fr:Beef and Mustard Pie": "Tourte au bœuf et à la moutarde",
  "en->fr:Preheat the oven to 150C/300F/Gas 2.": "Préchauffer le four à 150°C/300°F/Gas 2.",
  "en->fr:Toss the beef and flour together in a bowl with some salt and black pepper.": "Mélanger le bœuf et la farine dans un bol avec un peu de sel et de poivre noir.",
  "en->fr:Heat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.": "Chauffer une grande cocotte, ajouter la moitié de l'huile de colza et suffisamment de bœuf pour couvrir le fond de la cocotte.",
  "en->fr:Fry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.": "Faire frire jusqu'à ce que chaque côté soit doré, puis retirer et mettre de côté. Répéter l'opération avec le reste de l'huile et du bœuf.",
  "en->fr:Return the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.": "Remettre le bœuf dans la poêle, ajouter le vin et cuire jusqu'à ce que le volume du liquide ait réduit de moitié, puis ajouter le bouillon, l'oignon, les carottes, le thym et la moutarde, et bien assaisonner avec du sel et du poivre.",
  "en->fr:Cover with a lid and place in the oven for two hours.": "Couvrir avec un couvercle et mettre au four pendant deux heures.",
  "en->fr:Remove from the oven, check the seasoning and set aside to cool. Remove the thyme.": "Retirer du four, vérifier l'assaisonnement et laisser refroidir. Retirer le thym.",
  "en->fr:When the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.": "Lorsque le bœuf est refroidi et que vous êtes prêt à assembler la tarte, préchauffez le four à 200°C/400°F/Gas 6.",
  "en->fr:Transfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.": "Transférer le bœuf dans un plat à tarte, badigeonner le bord avec les jaunes d'œuf battus et déposer la pâte sur le dessus. Badigeonner le dessus de la pâte avec de l'œuf battu.",
  "en->fr:Trim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.": "Découper la pâte de manière à ce qu'il y ait juste assez d'excédent pour froncer les bords, puis mettre au four et cuire pendant 30 minutes, ou jusqu'à ce que la pâte soit dorée et bien cuite.",
  "en->fr:For the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.": "Pour les haricots verts, porter à ébullition une casserole d'eau salée, ajouter les haricots et les faire cuire pendant 4-5 minutes ou jusqu'à ce qu'ils soient tendres.",
  "en->fr:Drain and toss with the butter, then season with black pepper.": "Egoutter et mélanger avec le beurre, puis assaisonner de poivre noir.",
  "en->fr:To serve, place a large spoonful of pie onto each plate with some green beans alongside.": "Pour servir, déposer une grande cuillerée de tarte dans chaque assiette, accompagnée de quelques haricots verts.",
  "en->fr:15-minute chicken & halloumi burgers": "Burgers au poulet et au halloumi en 15 minutes",
  "en->fr:Put the chicken breasts between two pieces of baking parchment and use a rolling pin to gently bash them until they are approximately 1cm thick. Cut each chicken breast into two even pieces.": "Placez les blancs de poulet entre deux feuilles de papier sulfurisé et utilisez un rouleau à pâtisserie pour les écraser délicatement jusqu'à ce qu'ils atteignent environ 1 cm d'épaisseur. Couper chaque blanc de poulet en deux morceaux égaux.",
  "en->fr:If you're using a frying pan, heat two frying pans over medium-high heat, with one of them containing oil. Fry the chicken in the oiled pan for 3-4 mins on each side until they are cooked through. Season the chicken, reduce the heat, drizzle in the chilli sauce and half of the lemon juice, and cook for an additional 1-2 mins until the sauce is reduced. Remove the chicken from the heat.": "Si vous utilisez une poêle à frire, faites chauffer deux poêles à frire à feu moyen-vif, l'une d'entre elles contenant de l'huile. Faire frire le poulet dans la poêle huilée pendant 3-4 minutes de chaque côté jusqu'à ce qu'il soit bien cuit. Assaisonner le poulet, réduire le feu, verser la sauce chili et la moitié du jus de citron, et cuire pendant 1 à 2 minutes supplémentaires jusqu'à ce que la sauce soit réduite. Retirer le poulet du feu.",
  "en->fr:If you're using an air-fryer, preheat it to 180C for 4 mins. Add the chicken to the air-fryer and cook for 12 mins. Drizzle over the chilli sauce and half the lemon juice and cook for an additional 1-2 mins until the chicken is cooked through and the sauce is reduced. Remove the chicken and keep it warm.": "Si vous utilisez une friteuse, préchauffez-la à 180°C pendant 4 minutes. Ajoutez le poulet dans la friteuse et faites-le cuire pendant 12 minutes. Arrosez-le de sauce chili et de la moitié du jus de citron et faites-le cuire pendant 1 à 2 minutes supplémentaires, jusqu'à ce que le poulet soit bien cuit et que la sauce ait réduit. Retirer le poulet et le garder au chaud.",
  "en->fr:While the chicken is cooking, toast the buns in the dry frying pan for 30 seconds. Transfer them to a plate. If you're using an air fryer, put the buns in the air fryer for 1-2 mins until they are warm. Increase the air fryer temperature to 200C. Add the halloumi to the air fryer basket and cook for 10 mins, turning halfway through, until it's golden. Toss the cabbage with the mayo and the remaining lemon juice.": "Pendant la cuisson du poulet, faire griller les petits pains dans la poêle à sec pendant 30 secondes. Transférez-les dans une assiette. Si vous utilisez une friteuse, placez les petits pains dans la friteuse pendant 1 à 2 minutes jusqu'à ce qu'ils soient chauds. Augmentez la température de la friteuse à 200°C. Ajoutez le halloumi dans le panier de la friteuse et faites-le cuire pendant 10 minutes, en le retournant à mi-cuisson, jusqu'à ce qu'il soit doré. Mélangez le chou avec la mayo et le reste du jus de citron.",
  "en->fr:Spoon the hummus (or dip of your choice) into the toasted buns, then top with the rocket, chilli chicken, halloumi, and peppers. Drizzle with a little more chilli sauce, spoon over the cabbage, season with black pepper, and top with the bun lids. Serve with any extra cabbage on the side or a green salad.": "Verser le houmous (ou la sauce de votre choix) dans les petits pains grillés, puis recouvrir de roquette, de poulet au piment, de halloumi et de poivrons. Arroser d'un peu plus de sauce chili, ajouter le chou, assaisonner de poivre noir et recouvrir avec les couvercles des petits pains. Servir avec du chou supplémentaire ou une salade verte.",
  "en->fr:Apam balik": "Apam balik",
  "en->fr:Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.": "Mélanger le lait, l'huile et l'œuf. Tamiser la farine, la levure et le sel dans le mélange. Bien mélanger jusqu'à ce que tous les ingrédients soient combinés de façon homogène.",
  "en->fr:Spread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.": "Étaler un peu de pâte sur le moule. Étendre une fine couche de pâte sur le côté du moule. Couvrir le moule pendant 30 à 60 secondes jusqu'à ce que de petites bulles d'air apparaissent.",
  "en->fr:Add butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.": "Ajouter le beurre, la crème de maïs, les cacahuètes écrasées et le sucre sur la crêpe. Plier la crêpe en deux une fois que la surface inférieure est dorée.",
  "en->fr:Cut into wedges and best eaten when it is warm.": "Découpé en quartiers, il se déguste de préférence chaud.",
  "en->fr:Kapsalon": "Kapsalon",
  "en->fr:Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.": "Couper la viande en lanières. Faire chauffer de l'huile dans une poêle et faire frire les lanières pendant 6 minutes jusqu'à ce qu'elles soient prêtes.",
  "en->fr:Bake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.": "Cuire les frites jusqu'à ce qu'elles soient dorées dans une friteuse. Lorsqu'elles sont prêtes, les transférer dans un plat d'accompagnement. Veiller à ce que les frites soient réparties sur l'ensemble du plat.",
  "en->fr:Cover the fries with a new layer of meat and spread evenly.": "Recouvrir les frites d'une nouvelle couche de viande et l'étaler uniformément.",
  "en->fr:Add a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.": "Ajouter une couche de fromage sur la viande. Vous pouvez également utiliser du fromage râpé. Lorsque c'est fait, mettre au four pendant quelques minutes jusqu'à ce que le fromage soit fondu.",
  "en->fr:Chop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.": "Coupez la laitue, la tomate et le concombre en petits morceaux et mélangez-les pour obtenir une salade de base. Vous pouvez ajouter des olives, des piments jalapenos et un syndicat rouge.",
  "en->fr:Dived the salad over the dish and Serve with garlicsauce and hot sauce": "Plonger la salade dans le plat et servir avec de la sauce à l'ail et de la sauce piquante.",
  "en->fr:Bean & Sausage Hotpot": "Hotpot de haricots et de saucisses",
  "en->fr:In a large casserole, fry the sausages until brown all over – about 10 mins.": "Dans une grande cocotte, faire frire les saucisses jusqu'à ce qu'elles soient entièrement brunes - environ 10 minutes.",
  "en->fr:Add the tomato sauce, stirring well, then stir in the beans, treacle or sugar and mustard. Bring to the simmer, cover and cook for 30 mins. Great served with crusty bread or rice.": "Ajouter la sauce tomate en remuant bien, puis incorporer les haricots, la mélasse ou le sucre et la moutarde. Porter à frémissement, couvrir et laisser cuire pendant 30 minutes. Servir avec du pain croustillant ou du riz.",
  "en->fr:Chilli prawn linguine": "Linguine aux crevettes et au chili",
  "en->fr:Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.": "Mélanger les ingrédients de la vinaigrette dans un petit bol et assaisonner de sel et de poivre. Réserver.",
  "en->fr:Cook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.": "Faire cuire les pâtes selon les instructions du paquet. Ajouter les pois mange-tout pendant la dernière minute de cuisson.",
  "en->fr:Meanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.": "Pendant ce temps, faire chauffer l'huile dans un wok ou une grande poêle à frire, ajouter l'ail et le piment et faire cuire à feu assez doux pendant environ 30 secondes sans laisser l'ail brunir. Ajoutez les crevettes et faites-les cuire à feu vif, en remuant fréquemment, pendant environ 3 minutes, jusqu'à ce qu'elles deviennent roses.",
  "en->fr:Add the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.": "Ajouter les tomates et cuire, en remuant de temps en temps, pendant 3 minutes jusqu'à ce qu'elles commencent à ramollir. Bien égoutter les pâtes et les sugar snaps, puis les mélanger au mélange de crevettes. Ajouter les feuilles de basilic, remuer et assaisonner de sel et de poivre.",
  "en->fr:Serve with salad leaves drizzled with the lime dressing, and warm crusty bread.": "Servir avec des feuilles de salade arrosées de la vinaigrette au citron vert et du pain croûté chaud.",
  "en->fr: Bubble & Squeak": " Bulles et grincements",
  "en->fr:Melt the fat in a non-stick pan, allow it to get nice and hot, then add the bacon. As it begins to brown, add the onion and garlic. Next, add the sliced sprouts or cabbage and let it colour slightly. All this will take 5-6 mins.": "Faire fondre la graisse dans une poêle antiadhésive, la laisser bien chauffer, puis ajouter le bacon. Lorsqu'il commence à brunir, ajouter l'oignon et l'ail. Ajouter ensuite les germes ou le chou émincés et laisser légèrement colorer. Cette opération prend 5-6 minutes.",
  "en->fr:Next, add the potato. Work everything together in the pan and push it down so that the mixture covers the base of the pan – allow the mixture to catch slightly on the base of the pan before turning it over and doing the same again. It’s the bits of potato that catch in the pan that define the term ‘bubble and squeak’, so be brave and let the mixture colour. Cut into wedges and serve.": "Ajouter ensuite la pomme de terre. Mélangez le tout dans la casserole et poussez-la vers le bas de façon à ce que le mélange couvre le fond de la casserole - laissez le mélange s'accrocher légèrement au fond de la casserole avant de la retourner et de recommencer. Ce sont les morceaux de pommes de terre qui s'accrochent dans la poêle qui définissent le terme \"bulles et grincements\", alors soyez courageux et laissez le mélange se colorer. Coupez en quartiers et servez.",
  "en->fr:Baked salmon with fennel & tomatoes": "Saumon au four avec fenouil et tomates",
  "en->fr:Heat oven to 180C/fan 160C/gas 4. Trim the fronds from the fennel and set aside. Cut the fennel bulbs in half, then cut each half into 3 wedges. Cook in boiling salted water for 10 mins, then drain well. Chop the fennel fronds roughly, then mix with the parsley and lemon zest.": "Préchauffer le four à 180°C/an 160°C/gaz 4. Couper les frondes du fenouil et les mettre de côté. Couper les bulbes de fenouil en deux, puis couper chaque moitié en 3 quartiers. Cuire dans de l'eau bouillante salée pendant 10 minutes, puis bien égoutter. Hacher grossièrement les feuilles de fenouil, puis les mélanger avec le persil et le zeste de citron.",
  "en->fr:Spread the drained fennel over a shallow ovenproof dish, then add the tomatoes. Drizzle with olive oil, then bake for 10 mins. Nestle the salmon among the veg, sprinkle with lemon juice, then bake 15 mins more until the fish is just cooked. Scatter over the parsley and serve.": "Répartir le fenouil égoutté dans un plat peu profond allant au four, puis ajouter les tomates. Arroser d'huile d'olive et cuire au four pendant 10 minutes. Placer le saumon parmi les légumes, arroser de jus de citron et poursuivre la cuisson pendant 15 minutes, jusqu'à ce que le poisson soit à peine cuit. Saupoudrer de persil et servir.",
  "en->fr:Blini Pancakes": "Crêpes Blini",
  "en->fr:In a large bowl, whisk together 1/2 cup buckwheat flour, 2/3 cup all-purpose flour, 1/2 teaspoon salt, and 1 teaspoon yeast.": "Dans un grand bol, mélanger au fouet 1/2 tasse de farine de sarrasin, 2/3 tasse de farine tout usage, 1/2 cuillère à café de sel et 1 cuillère à café de levure.",
  "en->fr:Make a well in the center and pour in 1 cup warm milk, whisking until the batter is smooth.": "Faire un puits au centre et verser 1 tasse de lait chaud, en fouettant jusqu'à ce que la pâte soit lisse.",
  "en->fr:Cover the bowl and let the batter rise until doubled, about 1 hour.": "Couvrir le bol et laisser la pâte lever jusqu'à ce qu'elle ait doublé de volume, soit environ 1 heure.",
  "en->fr:Enrich and Rest the Batter": "Enrichir et reposer la batterie",
  "en->fr:Stir 2 tablespoons melted butter and 1 egg yolk into the batter.": "Incorporer 2 cuillères à soupe de beurre fondu et 1 jaune d'œuf à la pâte.",
  "en->fr:In a separate bowl, whisk 1 egg white until stiff, but not dry.": "Dans un autre bol, fouetter un blanc d'œuf en neige, mais sans le dessécher.",
  "en->fr:Fold the whisked egg white into the batter.": "Incorporer le blanc d'œuf battu en neige à la pâte.",
  "en->fr:Cover the bowl and let the batter stand 20 minutes.": "Couvrir le bol et laisser reposer la pâte pendant 20 minutes.",
  "en->fr:Pan-Fry the Blini": "Poêler les blinis",
  "en->fr:Heat butter in a large nonstick skillet over medium heat.": "Faire chauffer le beurre dans une grande poêle antiadhésive à feu moyen.",
  "en->fr:Drop quarter-sized dollops of batter into the pan, being careful not to overcrowd the pan. Cook for about 1 minute or until bubbles form.": "Déposer des cuillerées de pâte de la taille d'un quart dans la poêle, en veillant à ne pas la surcharger. Cuire pendant environ 1 minute ou jusqu'à ce que des bulles se forment.",
  "en->fr:Turn and cook for about 30 additional seconds.": "Retourner et cuire pendant environ 30 secondes supplémentaires.",
  "en->fr:Remove the finished blini onto a plate and cover them with a clean kitchen towel to keep warm. Add more butter to the pan and repeat the frying process with the remaining batter.": "Déposez les blinis finis sur une assiette et couvrez-les d'un torchon propre pour les garder au chaud. Ajoutez du beurre dans la poêle et recommencez le processus de friture avec le reste de la pâte.",
  "en->fr:Broccoli & Stilton soup": "Soupe aux brocolis et au stilton",
  "en->fr:Heat the rapeseed oil in a large saucepan and then add the onions. Cook on a medium heat until soft. Add a splash of water if the onions start to catch.": "Chauffer l'huile de colza dans une grande casserole et ajouter les oignons. Faire cuire à feu moyen jusqu'à ce qu'ils soient tendres. Ajouter un peu d'eau si les oignons commencent à s'accrocher.",
  "en->fr:Add the celery, leek, potato and a knob of butter. Stir until melted, then cover with a lid. Allow to sweat for 5 minutes. Remove the lid.": "Ajouter le céleri, le poireau, la pomme de terre et une noix de beurre. Remuer jusqu'à ce que le beurre soit fondu, puis couvrir avec un couvercle. Laisser suer pendant 5 minutes. Retirer le couvercle.",
  "en->fr:Pour in the stock and add any chunky bits of broccoli stalk. Cook for 10 – 15 minutes until all the vegetables are soft.": "Verser le bouillon et ajouter les morceaux de tige de brocoli. Faire cuire pendant 10 à 15 minutes jusqu'à ce que tous les légumes soient tendres.",
  "en->fr:Add the rest of the broccoli and cook for a further 5 minutes. Carefully transfer to a blender and blitz until smooth. Stir in the stilton, allowing a few lumps to remain. Season with black pepper and serve.": "Ajouter le reste du brocoli et faire cuire pendant 5 minutes supplémentaires. Transférer délicatement dans un mixeur et mixer jusqu'à obtention d'un mélange homogène. Incorporer le stilton en laissant quelques grumeaux. Assaisonner de poivre noir et servir.",
  "en->fr:Roast fennel and aubergine paella": "Paella au fenouil rôti et aux aubergines",
  "en->fr:1 Put the fennel, aubergine, pepper and courgette in a roasting tray. Add a glug of olive oil, season with salt and pepper and toss around to coat the veggies in the oil. Roast in the oven for 20 minutes, turning a couple of times until the veg are pretty much cooked through and turning golden.": "1 Placer le fenouil, l'aubergine, le poivron et la courgette dans une plaque à rôtir. Ajouter un peu d'huile d'olive, assaisonner de sel et de poivre et remuer pour enrober les légumes d'huile. Faire rôtir au four pendant 20 minutes, en les retournant plusieurs fois, jusqu'à ce que les légumes soient à peu près cuits et dorés.",
  "en->fr:2 Meanwhile, heat a paella pan or large frying pan over a low– medium heat and add a glug of olive oil. Sauté the onion for 8–10 minutes until softened. Increase the heat to medium and stir in the rice, paprika and saffron. Cook for around 1 minute to start toasting the rice, then add the white wine. Reduce by about half before stirring in two-thirds of the stock. Reduce to a simmer and cook for 10 minutes without a lid, stirring a couple of times.": "2 Pendant ce temps, chauffer une poêle à paella ou une grande poêle à frire à feu doux et moyen et ajouter un filet d'huile d'olive. Faire revenir l'oignon pendant 8 à 10 minutes jusqu'à ce qu'il soit ramolli. Augmentez le feu à moyen et ajoutez le riz, le paprika et le safran. Faire cuire pendant environ 1 minute pour commencer à griller le riz, puis ajouter le vin blanc. Réduire de moitié avant d'ajouter les deux tiers du bouillon. Réduire à frémissement et laisser cuire pendant 10 minutes sans couvercle, en remuant plusieurs fois.",
  "en->fr:3 Stir in the peas, add some seasoning, then gently mix in the roasted veg. Pour over the remaining stock, arrange the lemon wedges on top and cover with a lid or some aluminium foil. Cook for a further 10 minutes.": "3 Incorporer les petits pois, assaisonner, puis mélanger délicatement les légumes rôtis. Verser le reste du bouillon, disposer les quartiers de citron sur le dessus et couvrir avec un couvercle ou du papier d'aluminium. Laisser cuire encore 10 minutes.",
  "en->fr:4 To ensure you get the classic layer of toasted rice at the bottom of the pan, increase the heat to high until you hear a slight crackle. Remove from the heat and sit for 5 minutes before sprinkling over the parsley and serving.": "4 Pour obtenir la couche classique de riz grillé au fond de la poêle, augmentez le feu jusqu'à ce que vous entendiez un léger crépitement. Retirer du feu et laisser reposer pendant 5 minutes avant de saupoudrer le persil et de servir.",
  "en->fr:Baingan Bharta": "Baingan Bharta",
  "en->fr:Rinse the baingan (eggplant or aubergine) in water. Pat dry with a kitchen napkin. Apply some oil all over and": "Rincer le baingan (aubergine) à l'eau. Sécher avec une serviette de cuisine. Appliquer un peu d'huile sur toute la surface et",
  "en->fr:keep it for roasting on an open flame. You can also grill the baingan or roast in the oven. But then you won't get": "le conserver pour le faire rôtir sur une flamme nue. Vous pouvez également faire griller le baingan ou le faire rôtir au four. Mais dans ce cas, vous n'obtiendrez pas",
  "en->fr:the smoky flavor of the baingan. Keep the eggplant turning after a 2 to 3 minutes on the flame, so that its evenly": "la saveur fumée du baingan. Retourner l'aubergine après 2 à 3 minutes sur la flamme, afin qu'elle soit uniformément brûlée.",
  "en->fr:cooked. You could also embed some garlic cloves in the baingan and then roast it.": "cuit. Vous pouvez également incorporer quelques gousses d'ail dans le baingan et le faire rôtir.",
  "en->fr:2. Roast the aubergine till its completely cooked and tender. With a knife check the doneness. The knife should slid": "2. Rôtir l'aubergine jusqu'à ce qu'elle soit complètement cuite et tendre. Vérifiez la cuisson à l'aide d'un couteau. Le couteau doit glisser",
  "en->fr:easily in aubergines without any resistance. Remove the baingan and immerse in a bowl of water till it cools": "facilement dans les aubergines sans aucune résistance. Retirer le baingan et le plonger dans un bol d'eau jusqu'à ce qu'il refroidisse.",
  "en->fr:3. You can also do the dhungar technique of infusing charcoal smoky flavor in the baingan. This is an optional step.": "3. Vous pouvez également utiliser la technique du dhungar, qui consiste à infuser la saveur fumée du charbon de bois dans le baingan. Cette étape est facultative.",
  "en->fr:Use natural charcoal for this method. Heat a small piece of charcoal on flame till it becomes smoking hot and red.": "Utilisez du charbon de bois naturel pour cette méthode. Chauffez un petit morceau de charbon de bois sur la flamme jusqu'à ce qu'il devienne fumant et rouge.",
  "en->fr:4. Make small cuts on the baingan with a knife. Place the red hot charcoal in the same plate where the roasted": "4. Faire de petites entailles sur le baingan à l'aide d'un couteau. Placer le charbon de bois rouge dans la même assiette que celle où se trouvent les",
  "en->fr:aubergine is kept. Add a few drops of oil on the charcoal. The charcoal would begin to smoke.": "L'aubergine est conservée. Ajoutez quelques gouttes d'huile sur le charbon de bois. Le charbon de bois commence à fumer.",
  "en->fr:5. As soon as smoke begins to release from the charcoal, cover the entire plate tightly with a large bowl. Allow the": "5. Dès que la fumée commence à se dégager du charbon de bois, recouvrir hermétiquement la plaque avec un grand bol. Laisser le",
  "en->fr:charcoal smoke to get infused for 1 to 2 minutes. The more you do, the more smoky the baingan bharta will": "Le baan bharta doit être fumé avec de la fumée de charbon de bois pendant 1 à 2 minutes. Plus vous le faites, plus le baingan bharta sera fumé.",
  "en->fr:become. I just keep for a minute. Alternatively, you can also do this dhungar method once the baingan bharta is": "devenir. Je le garde juste une minute. Vous pouvez également utiliser la méthode dhungar une fois que le baingan bharta est",
  "en->fr:cooked, just like the way we do for Dal Tadka.": "cuit, comme nous le faisons pour le Dal Tadka.",
  "en->fr:6. Peel the skin from the roasted and smoked eggplant.": "6. Retirer la peau des aubergines grillées et fumées.",
  "en->fr:7. Chop the cooked eggplant finely or you can even mash it.": "7. Hacher finement l'aubergine cuite ou la réduire en purée.",
  "en->fr:8. In a kadai or pan, heat oil. Then add finely chopped onions and garlic.": "8. Dans un kadai ou une poêle, faire chauffer l'huile. Ajouter les oignons et l'ail finement hachés.",
  "en->fr:9. Saute the onions till translucent. Don't brown them.": "9. Faire sauter les oignons jusqu'à ce qu'ils soient translucides. Ne les faites pas brunir.",
  "en->fr:10. Add chopped green chilies and saute for a minute.": "10. Ajouter les piments verts hachés et faire sauter pendant une minute.",
  "en->fr:11. Add the chopped tomatoes and mix it well.": "11. Ajouter les tomates coupées en morceaux et bien mélanger.",
  "en->fr:12. Bhuno (saute) the tomatoes till the oil starts separating from the mixture.": "12. Faire sauter les tomates jusqu'à ce que l'huile commence à se détacher du mélange.",
  "en->fr:13. Now add the red chili powder. Stir and mix well.": "13. Ajouter maintenant le piment rouge en poudre. Remuer et bien mélanger.",
  "en->fr:14. Add the chopped cooked baingan.": "14. Ajouter le baingan cuit et haché.",
  "en->fr:15. Stir and mix the chopped baingan very well with the onion­tomato masala mixture.": "15. Remuer et bien mélanger le baingan haché avec le mélange oignon-tomate-masala.",
  "en->fr:16. Season with salt. Stir and saute for some more 4 to 5 minutes more.": "16. Assaisonner avec du sel. Remuer et faire sauter encore 4 à 5 minutes.",
  "en->fr:17. Finally stir in the coriander leaves with the baingan bharta or garnish it with them. Serve Baingan Bharta with": "17. Enfin, incorporez les feuilles de coriandre au baingan bharta ou décorez-le avec elles. Servir le Baingan Bharta avec",
  "en->fr:phulkas, rotis or chapatis. It goes well even with bread, toasted or grilled bread and plain rice or jeera rice.": "phulkas, rotis ou chapatis. Il se marie également très bien avec du pain, du pain grillé ou toasté et du riz nature ou du riz jeera.",
  "en->fr:Bread omelette": "Omelette au pain",
  "en->fr:Make and enjoy": "Préparer et déguster",
  "en->fr:Mbuzi Choma (Roasted Goat)": "Mbuzi Choma (chèvre rôtie)",
  "en->fr:1. Steps for the Meat:": "1. Etapes pour la viande :",
  "en->fr:Roast meat over medium heat for 50 minutes and salt it as you turn it.": "Rôtir la viande à feu moyen pendant 50 minutes et la saler au fur et à mesure que vous la retournez.",
  "en->fr:2. Steps for Ugali:": "2. Étapes pour l'Ugali :",
  "en->fr:Bring the water and salt to a boil in a heavy-bottomed saucepan. Stir in the cornmeal slowly, letting it fall through the fingers of your hand.": "Dans une casserole à fond épais, porter à ébullition l'eau et le sel. Incorporer lentement la farine de maïs, en la laissant tomber entre les doigts de la main.",
  "en->fr:3. Reduce heat to medium-low and continue stirring regularly, smashing any lumps with a spoon, until the mush pulls away from the sides of the pot and becomes very thick, about 10 minutes.": "3. Réduire le feu à moyen-doux et continuer à remuer régulièrement, en écrasant les éventuels grumeaux à l'aide d'une cuillère, jusqu'à ce que la bouillie se détache des parois de la casserole et devienne très épaisse, soit environ 10 minutes.",
  "en->fr:4.Remove from heat and allow to cool.": "4. retirer du feu et laisser refroidir.",
  "en->fr:5. Place the ugali into a large serving bowl. Wet your hands with water, form a ball and serve.": "5. Placer l'ugali dans un grand bol de service. Se mouiller les mains avec de l'eau, former une boule et servir.",
  "en->fr:6. Steps for Kachumbari: Mix the tomatoes, onions, chili and coriander leaves in a bowl.": "6. Etapes pour le Kachumbari : Mélanger les tomates, les oignons, le piment et les feuilles de coriandre dans un bol.",
  "en->fr:7. Serve and enjoy!": "7. Servez et savourez !"
}